app/controllers/admin/orders_controller.rb

  def index
    @orders = Order.paginate :page => params[:page],
                             :order => 'id DESC'
---
SELECT * FROM "orders" ORDER BY id DESC LIMIT 30 OFFSET 0