app/controllers/admin/products_controller.rb

SELECT * FROM "products" ORDER BY name LIMIT 30 OFFSET 0
---
  def index
    @products = Product.paginate(:page => params[:page], :order => 'name')

SELECT * FROM "products" WHERE ("products"."id" = 1) LIMIT 1
---
  def edit
    @product = Product.find(params[:id])