app/controllers/admin/product_images_controller.rb

  def create
    product = Product.find(params[:product_id])
    product_image = ProductImage.new(params[:product_image])
    product.product_images << product_image
---
INSERT INTO "product_images" ("product_id", "filename") VALUES(1, 'test.jpg') RETURNING "id"