app/controllers/index_controller.rb

  def index
    @featured_products = Product.find(:all, :conditions => { :is_featured => true })
---
SELECT * FROM "products" WHERE ("products"."is_featured" = 't')